#include <H1/Ints.h>

#include <EDITOR/EDITOR.h>

#include <BASE/baseManager.h>
#include <BASE/bmap2.h>
#include <BASE/executive.h>
#include <BASE/font.h>
#include <BASE/heroWindow.h>
#include <BASE/heroWindowManager.h>
#include <BASE/inputManager.h>
#include <BASE/message.h>
#include <BASE/Misc.h>
#include <BASE/miscwin.h>
#include <BASE/mouseManager.h>
#include <BASE/palette.h>
#include <BASE/resourceManager.h>
#include <BASE/textWidget.h>
#include <EDITOR/editManager.h>
#include <EDITOR/eventsManager.h>
#include <EDITOR/overlayManager.h>
#include <SOURCE/appMenu.h>
#include <SOURCE/dialogTypes.h>
#include <SOURCE/game.h>
#include <SOURCE/KB.h>
#include <SOURCE/kbwin.h>
#include <SOURCE/mapCell.h>
#include <SOURCE/NOOPT.h>
#include <SOURCE/wingraph.h>

#include <ctype.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#define EDITOR_CPP_PATH "U:\\HMM\\VSS\\HMM1\\Source\\Editor\\EDITOR.CPP"

i16 gRadarTerrainColor[24] = {
    82,  99, 7,   180, 26,  123, 55, 0,  16, 48, 98, 160,
    126, 74, 110, 179, 100, 218, 12, 12, 12, 12, 12, 12,
};
i16 gVesaMode[6] = {640, 480, 256, 20226, 257, 0};
b32 gShowIt = true;
b32 gEnlargeScreenBlit = true;
b8 gCommandLineInterpreted = true;
b8 gShowMapInfo = true;
i32 gUnusedData43ede8 = 1;
char gDataPath[352] = ".\\DATA\\";
char gAnimPath[352] = ".\\ANIM\\";
char gSoundPath[352] = ".\\SOUND\\";
char gTracksPath[352] = "\\TRACKS\\";
char gGamePath[20] = ".\\GAMES\\";
char gMapPath[20] = ".\\MAPS\\";
i32 gCurExe = CONFIG_EXECUTABLE_EDITOR;
b32 gNewMapFormat = true;
i32 gClearFlags = EDITOR_CLEAR_FLAGS_DEFAULT;
i32 gSelectionX = EDIT_NO_CELL;
double gTerrainPercent[EDITOR_TERRAIN_COUNT] = {30.0, 30.0, 20.0, 0.0, 0.0, 0.0, 20.0};
double gDensityPercent[EDITOR_GENERATOR_DENSITY_COUNT] = {50.0, 50.0, 50.0, 50.0, 50.0};
b32 gScatterTerrain = true;
SMenuEnableStatus gMenuEnableStatus[70] = {
    {0, 0, 0, 0},     {40005, 1, 1, 0}, {40006, 1, 1, 0}, {40007, 1, 1, 0}, {40008, 1, 1, 0},
    {40009, 1, 1, 0}, {40012, 0, 0, 0}, {40013, 0, 0, 0}, {40014, 0, 0, 0}, {40015, 0, 0, 0},
    {40016, 1, 0, 0}, {40017, 1, 0, 0}, {40018, 1, 0, 0}, {40019, 1, 0, 0}, {40020, 1, 0, 0},
    {40021, 1, 0, 0}, {40022, 1, 0, 0}, {40023, 1, 0, 0}, {40024, 1, 0, 0}, {40025, 1, 0, 0},
    {40026, 1, 0, 0}, {40028, 1, 0, 0}, {40029, 1, 0, 0}, {40030, 1, 0, 0}, {40031, 1, 0, 0},
    {40032, 1, 0, 0}, {40033, 1, 0, 0}, {40034, 1, 0, 0}, {40035, 1, 0, 0}, {40036, 1, 0, 0},
    {40037, 1, 0, 0}, {40038, 1, 0, 0}, {40040, 0, 0, 0}, {40041, 0, 0, 0}, {40042, 0, 0, 0},
    {40043, 0, 0, 0}, {40044, 0, 0, 0}, {40045, 0, 0, 0}, {40046, 0, 0, 0}, {40047, 0, 0, 0},
    {40052, 1, 1, 0}, {40053, 1, 1, 0}, {40102, 0, 1, 0}, {40104, 0, 1, 0}, {40105, 0, 1, 0},
    {40106, 0, 1, 0}, {40107, 0, 1, 0}, {40109, 0, 1, 0}, {40110, 0, 1, 0}, {40111, 0, 1, 0},
    {40112, 0, 1, 0}, {40114, 0, 1, 0}, {40115, 0, 1, 0}, {40117, 0, 1, 0}, {40118, 0, 1, 0},
    {40120, 0, 1, 0}, {40121, 0, 1, 0}, {40123, 0, 1, 0}, {40124, 0, 1, 0}, {40127, 0, 1, 0},
    {40128, 0, 1, 0}, {40129, 0, 1, 0}, {40131, 0, 1, 0}, {40132, 0, 1, 0}, {40134, 0, 1, 0},
    {40135, 0, 1, 0}, {40137, 0, 1, 0}, {40138, 0, 1, 0}, {40139, 0, 0, 0}, {40140, 0, 0, 0},
};
WindowTextEntry gWinSetup[WINDOW_TEXT_EDITOR_ENTRY_COUNT] = {
    {500, EVENTS_WINDOW_TEXT_TOWN},        {501, EVENTS_WINDOW_TEXT_TOWN},
    {504, EVENTS_WINDOW_TEXT_TOWN},        {505, EVENTS_WINDOW_TEXT_TOWN},
    {506, EVENTS_WINDOW_TEXT_TOWN},        {507, EVENTS_WINDOW_TEXT_TOWN},
    {508, EVENTS_WINDOW_TEXT_TOWN},        {509, EVENTS_WINDOW_TEXT_TOWN},
    {510, EVENTS_WINDOW_TEXT_TOWN},        {511, EVENTS_WINDOW_TEXT_TOWN},
    {561, EVENTS_WINDOW_TEXT_TOWN},        {562, EVENTS_WINDOW_TEXT_TOWN},
    {567, EVENTS_WINDOW_TEXT_TOWN},        {527, EVENTS_WINDOW_TEXT_TOWN},
    {528, EVENTS_WINDOW_TEXT_TOWN},        {529, EVENTS_WINDOW_TEXT_TOWN},
    {530, EVENTS_WINDOW_TEXT_TOWN},        {531, EVENTS_WINDOW_TEXT_TOWN},
    {532, EVENTS_WINDOW_TEXT_TOWN},        {533, EVENTS_WINDOW_TEXT_TOWN},
    {534, EVENTS_WINDOW_TEXT_TOWN},        {535, EVENTS_WINDOW_TEXT_TOWN},
    {536, EVENTS_WINDOW_TEXT_TOWN},        {537, EVENTS_WINDOW_TEXT_TOWN},
    {500, EVENTS_WINDOW_TEXT_MONSTER},     {500, EVENTS_WINDOW_TEXT_HERO},
    {504, EVENTS_WINDOW_TEXT_HERO},        {505, EVENTS_WINDOW_TEXT_HERO},
    {506, EVENTS_WINDOW_TEXT_HERO},        {507, EVENTS_WINDOW_TEXT_HERO},
    {508, EVENTS_WINDOW_TEXT_HERO},        {509, EVENTS_WINDOW_TEXT_HERO},
    {510, EVENTS_WINDOW_TEXT_HERO},        {511, EVENTS_WINDOW_TEXT_HERO},
    {561, EVENTS_WINDOW_TEXT_HERO},        {527, EVENTS_WINDOW_TEXT_HERO},
    {528, EVENTS_WINDOW_TEXT_HERO},        {529, EVENTS_WINDOW_TEXT_HERO},
    {530, EVENTS_WINDOW_TEXT_HERO},        {531, EVENTS_WINDOW_TEXT_HERO},
    {532, EVENTS_WINDOW_TEXT_HERO},        {101, EVENTS_WINDOW_TEXT_CLEAR},
    {102, EVENTS_WINDOW_TEXT_CLEAR},       {103, EVENTS_WINDOW_TEXT_CLEAR},
    {104, EVENTS_WINDOW_TEXT_CLEAR},       {101, EVENTS_WINDOW_TEXT_MAP_DETAILS},
    {102, EVENTS_WINDOW_TEXT_MAP_DETAILS}, {103, EVENTS_WINDOW_TEXT_MAP_DETAILS},
    {104, EVENTS_WINDOW_TEXT_MAP_DETAILS}, {105, EVENTS_WINDOW_TEXT_MAP_DETAILS},
    {320, EVENTS_WINDOW_TEXT_NEW_MAP},     {321, EVENTS_WINDOW_TEXT_NEW_MAP},
    {300, EVENTS_WINDOW_TEXT_NEW_MAP},     {301, EVENTS_WINDOW_TEXT_NEW_MAP},
    {302, EVENTS_WINDOW_TEXT_NEW_MAP},     {303, EVENTS_WINDOW_TEXT_NEW_MAP},
    {304, EVENTS_WINDOW_TEXT_NEW_MAP},     {305, EVENTS_WINDOW_TEXT_NEW_MAP},
    {306, EVENTS_WINDOW_TEXT_NEW_MAP},     {820, EVENTS_WINDOW_TEXT_NEW_MAP},
    {821, EVENTS_WINDOW_TEXT_NEW_MAP},     {800, EVENTS_WINDOW_TEXT_NEW_MAP},
    {801, EVENTS_WINDOW_TEXT_NEW_MAP},     {802, EVENTS_WINDOW_TEXT_NEW_MAP},
    {803, EVENTS_WINDOW_TEXT_NEW_MAP},     {804, EVENTS_WINDOW_TEXT_NEW_MAP},
    {1200, EVENTS_WINDOW_TEXT_NEW_MAP},    {1201, EVENTS_WINDOW_TEXT_NEW_MAP},
    {1202, EVENTS_WINDOW_TEXT_NEW_MAP},    {1400, EVENTS_WINDOW_TEXT_NEW_MAP},
};
char* gTerrainToolHelp[EDITOR_TERRAIN_TOOL_HELP_COUNT] = {
    "",
    "Вода\n\nЗдесь можно путешествовать только на корабле.",
    "Трава\n\nНет ограничений.",
    "Снег\n\nВсе герои, кроме варвара, за 1 шаг тратят 1,5 единицы движения.",
    "Болото\n\n Все герои, кроме варвара, за 1 шаг тратят 1,5 единицы движения.",
    "Лава\n\nНет ограничений.",
    "Пустыня\n\n Все герои, кроме варвара, за 1 шаг тратят 2 единицы движения.",
    "Земля\n\nНет ограничений."
};
char* gClearToolHelp[EDITOR_CLEAR_TOOL_HELP_COUNT] = {
    "",
    "Обеспечивает более детальное управление процессом удаления объектов."
};
char* gOverlayToolHelp[EDITOR_OVERLAY_TOOL_HELP_COUNT] = {
    "",
    "Выбранный объект."
};
char* gEditButtonHelp[EDITOR_BUTTON_HELP_COUNT] = {
    "",
    "Прокрутка\n\nПрокрутить экран в указанном направлении.",
    "Переключение между режимом увеличения и обычным просмотром.",
    "Отменить последнее действие. Нажмите еще раз, чтобы повторить отмененное действие.",
    "Изменить название карты, описание и другую информацию о карте.",
    "Начать новую карту с нуля.",
    "Загрузить существующую карту.",
    "Сохранить карту на диск.",
    "Выйти",
    "Использовать генератор случайных карт.",
};
char* gEditAreaHelp[EDITOR_AREA_HELP_COUNT] = {
    "",
    "Радарная карта\n\nУправляет положением камеры.",
    "Скроллинг\n\nИспользуется для перемещения карты по осям экрана.",
    "Земля\n\nИспользуется для рисования разных типов земли.",
    "Объекты\n\nИспользуется для размещения объектов (горы, деревья и т.п.) на карте.",
    "Информация\n\nИспользуется для указания количества монстров, редактирования героев и городов.",
    "Ластик\n\nИспользуется для удаления объектов с карты.",
    "Карта\n\nЗдесь рисуют саму карту!",
};
char* gGeneratorTerrainNames[EDITOR_TERRAIN_COUNT] = {
    "Вода",
    "Трава",
    "Снег",
    "Болото",
    "Лава",
    "Пустыня",
    "Земля"
};
char* gOverlayCategoryNames[OVERLAY_CATEGORY_COUNT] = {
    "1 - Вода",
    "2 - Трава",
    "3 - Снег",
    "4 - Болота",
    "5 - Лава",
    "6 - Пустыня",
    "7 - Грязь",
    "8 - Города",
    "9 - Монстры",
    "10 - Артефакты",
    "11 - Сокровища"
};
char* gWinSetupText[WINDOW_TEXT_EDITOR_ENTRY_COUNT] = {
    "Свойства города/замка",
    "Изменить",
    "ID",
    "Название",
    "Кол-во.",
    "Мон 1",
    "Мон 2",
    "Мон 3",
    "Мон 4",
    "Мон 5",
    "Владелец:",
    "Случ.",
    "Нейт.",
    "Гильдия магов / Ур.",
    "Гильдия воров",
    "Таверна",
    "Верфь",
    "Колодец",
    "Жилище 1",
    "Жилище 2",
    "Жилище 3",
    "Жилище 4",
    "Жилище 5",
    "Жилище 6",
    "Свойства монстра\n\n \n\n0 для случайного кол-ва.\n\nили введите положительное число",
    "Свойства героя",
    "ID",
    "Имя",
    "Кол-во.",
    "Мон 1",
    "Мон 2",
    "Мон 3",
    "Мон 4",
    "Мон 5",
    "Хозяин:",
    "ID героя",
    "Артефакт 1",
    "Артефакт 2",
    "Артефакт 3",
    "Артефакт 4",
    "Опыт",
    "Вода:\n\nЗемля:\n\nСнег:\n\nБолота:\n\nЛава:\n\nПустыня:\n\nГрязь:",
    "Города:\n\nМонстры:\n\nАртефакты:\n\nСокровища:",
    "Все закрасить:",
    "Обновить карту:",
    "Легкая:\n\nОбычная:\n\nТяжелая:\n\nНепроходимая:",
    "Маленькая:\n\nСредняя:\n\nБольшая:",
    "Название:",
    "Описание:",
    "Префикс файла:",
    "Нет",
    "Много",
    "Вода:",
    "Трава:",
    "Снег:",
    "Болото:",
    "Лава:",
    "Пустыня:",
    "Грязь:",
    "Мало",
    "Много",
    "Горы:",
    "Деревья:",
    "Шахты:",
    "Сокровища:",
    "Монстры:",
    "Доля земли:",
    "Вразброс:",
    "По центру:",
    "Сохранить без просмотра:"
};
char* gArtifactNames[ARTIFACT_COUNT] = {
    "Книга всезнания",  "Меч власти",
    "Защитная накидка",  "Жезл магии",
    "Ожерелье тайной магии",  "Магический браслет",
    "Кольцо мага",  "Брошь ведьмы",
    "Медаль отваги",  "Медаль мужества",
    "Медаль доблести", "Медаль почета",
    "Символ неудачи", "Громовая алица ",
    "Защитная перчатка", "Шлем защитника",
    "Гигантский цеп", "Баллиста",
    "Незримый щит", "Драконий меч",
    "Топор власти", "Божественный доспех",
    "Малый свиток знания", "Большой свиток знания",
    "Могущественный свиток знания", "Свиток высшего знания",
    "Бездонный мешок", "Бездонная сума",
    "Бездонный кошель", "Башмаки кочевника",
    "Башмаки путника", "Лапка кролика",
    "Золотая подкова", "Счастливая монета",
    "Клевер", "Компас",
    "Астролябия", "Волшебная книга",
};
char* gArtifactDesc[ARTIFACT_COUNT] = {
    "Книга всезнания\n(Знания +12)\n\nКнига всезнания увеличивает Знания на 12 единиц.",  "Меч власти\n(Атака +12)\n\nМеч власти увеличивает навык атаки на 12 единиц.",
    "Защитная накидка\n(Защита +12)\n\nЗащитная накидка увеличивает защиту на 12 единиц.",  "Жезл магии\n(Сила магии +12)\n\nЖезл магии увеличивает силу заклинаний на 12 единиц.",
    "Ожерелье тайной магии\n(Сила магии +4)\n\nОжерелье тайной магии увеличивает силу магии на 4 единицы.",  "Магический браслет\n(Сила магии +2)\n\nМагический браслет увеличивает силу заклинаний на 2 единицы.",
    "Кольцо мага\n(Сила магии +2)\n\nКольцо мага увеличивает силу магии на 2 единицы.",  "Брошь ведьмы\n(Сила магии +3)\n\nБрошь ведьмы увеличивает силу магии на 3 единицы.",
    "Медаль отваги\n\nМедаль отваги увеличивает мораль.",  "Медаль мужества\n\nМедаль мужества увеличивает мораль.",
    "Медаль доблести\n\nМедаль доблести увеличивает мораль.", "Медаль почета\n\nМедаль почета увеличивает мораль.",
    "Символ неудачи\n\nСимвол неудачи сильно уменьшает мораль.", "Громовая палица\n(Атака +1)\n\nГромовая палица увеличивает навык атаки на 1 единицу.",
    "Защитная перчатка\n(Защита +1)\n\nЗащитная перчатка увеличивает навык защиты на 1 единицу.", "Шлем защитника\n(Защита +1)\n\nШлем защитника увеличивает навык защиты на 1 единицу.",
    "Гигантский цеп\n(Атака +1)\n\nГигантский цеп увеличивает навык атаки на 1 единицу.", "Баллиста\n\nБаллиста позволяет вашей катапульте дважды стрелять в один ход боя.",
    "Незримый щит\n(Защита +2)\n\nНезримый щит увеличивает навык защиты на 2 единицы.", "Драконий меч\n(Атака +3)\n\nДраконий меч увеличивает навык атаки на 3 единицы.",
    "Топор власти\n(Атака +2)\n\nТопор власти увеличивает навык атаки на 2 единицы.", "Божественный доспех\n(Защита +3)\n\nБожественный доспех увеличивает навык защиты на 3 единицы.",
    "Малый свиток знания\n(Знания +2)\n\nМалый свиток знания увеличивает Знания на 2 единицы.", "Большой свиток знания\n(Знания +3)\n\nБольшой свиток знания увеличивает Знания на 3 единицы.",
    "Могущественный свиток знания\n(Знания +4)\n\nМогущественный свиток знания увеличивает Знания на 4 единицы.", "Свиток высшего знания\n(Знания +5)\n\nСвиток высшего знания увеличивает Знания на 5 единиц.",
    "Бездонный мешок\n\nБездонный мешок приносит вам 1000 золотых в день.", "Бездонная сума\n\nБездонная сума приносит вам 750 золотых в день.",
    "Бездонный кошель\n\nБездонный кошель приносит вам 500 золотых в день.", "Башмаки кочевника\n\nБашмаки кочевника увеличивают дальность передвижения по суше.",
    "Башмаки путника\n\nБашмаки путника увеличивают подвижность отряда на суше.", "Лапка кролика\n\nЛапка кролика увеличивает удачу в бою.",
    "Золотая подкова\n\nЗолотая подкова увеличивает удачу в бою.", "Монета\n\nСчастливая монета увеличивает удачу в бою.",
    "Клевер\n\nКлевер увеличивает удачу в бою.", "Компас\n\nКомпас увеличивает подвижность отряда на суше и на море.",
    "Астролябия\n\nАстролябия увеличивает подвижность отряда на море.", "Волшебная книга\n\nВолшебная книга позволяет направлять заклинания.",
};
char* gArtifactEvent[38] = {
    "",
    "",
    "",
    "",
    "Вы вызволяете волшебницу, заточенную в проклятой гробнице, и в награду она вручает вам изысканное алмазное ожерелье.",
    "Изучая завалы в заброшенной шахте, вы спасаете артель гномов-старателей. В знак благодарности их старшина дарит вам золотой браслет.",
    "Вы спешите на звук отчаянного вопля боли и видите кентавра, попавшего в западню. Вы помогаете ему освободиться, и он вручает вам кожаный мешочек. Заглянув внутрь, вы видите ослепительное бриллиантовое кольцо.",
    "Рядом с останками сожженной колдуньи лежит изящная брошь прекрасной работы. Осторожно приблизившись к обугленному трупу, вы забираете брошь себе.",
    "В награду за спасение прекрасной девы от посягательств ненавистного барона королевский герольд вручает вам Медаль отваги.",
    "Вы спасаете маленького мальчика от стаи кровожадных волков и провожаете в имение родителей. Счастливый отец награждает вас Медалью мужества.",
    "Вы вырываете принцессу соседнего королевства из мерзких лап презренных работорговцев и в награду за подвиг получаете Медаль доблести.",
    "Вы избавляете округу от ужасного минотавра, добычей которому служили благородные рыцари, и становитесь кавалером Медали почета.",
    "На обочине пустынной дороги вы находите медаль. Вы подобрали ее и обнаружили, что стали несчастным обладателем Символа неудачи, который понижает мораль вашей армии.",
    "Во время жуткой грозы молния бьет в дерево, разнося его на мелкие щепки. Среди обломков вы обнаруживаете таинственную палицу.",
    "Вы повстречали печально известного Черного Рыцаря! Ваш поединок заканчивается вничью, и рыцарь в знак уважения дарит вам пару латных перчаток.",
    "Краем глаза вы замечаете золотистый блеск среди пышной зелени. Приглядевшись внимательнее, вы находите под кустами великолепный золотой шлем.",
    "Неуклюжий гигант нанес себе смертельную рану собственным боевым цепом. Вы прекрасно владеете этим оружием и с уверенностью вынимаете цеп из мертвых рук гиганта.",
    "Пробираясь через развалины древней крепости, вы находите орудие, которое превратило ее в руины, удивительную баллисту замысловатой конструкции.",
    "В руках у каменной статуи воина - великолепный серебряный щит. Как только вы забираете щит себе, статуя рассыпается в прах.",
    "Вы пробираетесь узкой тропой, как вдруг ближайший куст загорается ярким пламенем. Постепенно в огненном смерче проступают очертания прекрасной дамы, которая протягивает вам меч чудесной работы.",
    "Вы видите серебряный топор, вогнанный в землю по самую рукоять. Ваши воины пытаются выдернуть его, но усилия их тщетны. Вам же хватило одного усилия и топор у вас в руках!",
    "Шайка разбойников обыскивает тела мертвых воинов. Вы разгоняете мародеров и вдруг замечаете, что в спешке они потеряли великолепный доспех.",
    " Перед вами возникает парящий в воздухе стеклянный ларец со свитком внутри, лежащем на подушке из пурпурного бархата. Повинуясь вашему прикосновению, крышка ларца открывается, и свиток оказывается у вас в руках.",
    "Вы навещаете местного мудреца и рассказываете о цели вашего путешествия. Он достает из мешка пожелтевший свиток и передает его вам.",
    "Вы стоите перед останками давно умершей жрицы друидов. Пожелтевшие от времени кости проглядывают через прорехи истлевшего одеяния. Пошевелив груду ветоши, вы находите древний свиток.",
    "Груда пожелтевших костей и обрывки истлевшей материи - вот все, что осталось от жрицы друидов. Среди этих останков вы замечаете таинственный свиток.",
    "Маленький лепрекон пританцовывает у волшебного мешка. Завидев вас, он замирает на месте, затем издает возмущенный возглас, топает ножкой и растворяется в воздухе. Следуя старинной поговорке, \"Кто успел - тот и съел\", вы забираете мешок себе.",
    "Благородная путешественница, отбившаяся от спутников, просит вас о помощи. Проводив ее до дома, вы получаете в награду суму, полную золота.",
    "Однажды вам в руки попадает наполненный золотом кожаный кошель, принадлежавший великому королю, который умел превращать любой предмет в золото.",
    "Бродячий торговец просит вас защитить его от банды гоблинов. В награду он дарит вам пару изящных башмаков, испещеренных загадочными древними письменами.",
    "Обнаружив пару замечательных башмаков украшенных бисером, вы благодарите загадочного благодетеля и оставляете их себе.",
    "В уплату за охрану в пути странствующий торговец предлагает вам лапку кролика. По его словам, она принесет вам удачу в бою.",
    "Попавший в ловушку единорог испуганно кричит. Вы успокаиваете его и освобождаете от пут. Всхрапнув и ударив копытом, он уносится прочь. Там, где он только что стоял, осталась лежать золотая подкова.",
    "Вы поймали озорного бесенка, который не давал покоя всей округе. В обмен на свободу он предлагает вам волшебную монету.",
    "Посреди мертвой лощины, заполненной иссохшей растительностью, вы, к своему удивлению, замечете веселый зеленый побег четырехлистного клевера.",
    "Странноватый старикашка утверждает, что он - великий изобретатель, и просит вас испытать его новое творение. Надувшись от важности, он вручает вам компас.",
    "Старый мореход стал добычей людоедов. Вы спасаете его, и в знак благодарности он дарит вам чудесный инструмент, позволяющий измерять расстояния по звездам.",
    "Волшебная книга?!",
};
char* gStatNames[5] = {
    "Атака",
    "Защита",
    "Сила магии",
    "Знания",
    "Осада"
};
char* gStatDesc[5] = {
    "Ваш навык атаки - бонус, добавляемый к навыку атаки каждого воина.",
    "Ваш навык защиты - бонус, добавляемый к навыку защиты каждого воина.",
    "Ваш уровень силы магии определяет длительность действия или силу заклинания.",
    "Ваш уровень знания определяет количество запоминаемых заклинаний.",
    "Ваш уровень навыка осадного дела определяет, сколько раз будет стрелять ваша катапульта при осаде замка.",
};
char* gClassNames[4] = {
    "Рыцарь",
    "Варвар",
    "Колдунья",
    "Чернокнижник"
};
char* gArmyNames[CREATURE_COUNT] = {
    "Крестьянин",  "Лучник",
    "Копейщик",  "Мечник",
    "Всадник",  "Паладин",
    "Гоблин",  "Орк",
    "Волк",  "Огр",
    "Тролль", "Циклоп",
    "Фея", "Гном",
    "Эльф", "Друид",
    "Единорог", "Феникс",
    "Кентавр", "Горгулья",
    "Грифон", "Минотавр",
    "Гидра", "Дракон",
    "Разбойник", "Кочевник",
    "Призрак", "Джинн",
};
char* gArmySpriteNames[CREATURE_COUNT] = {
    "peasant",  "archer", "pikeman", "swordsman", "cavalry", "paladin",  "goblin",
    "orc",      "wolf",   "ogre",    "troll",     "cyclops", "sprite",   "dwarf",
    "elf",      "druid",  "unicorn", "phoenix",   "centaur", "gargoyle", "griffin",
    "minotaur", "hydra",  "dragon",  "rogue",     "nomad",   "ghost",    "genie"
};
char* gArmyNamesPlural[CREATURE_COUNT] = {
    "крестьян",  "лучников",
    "копейщиков",  "мечников",
    "всадников",  "паладинов",
    "гоблинов",  "орков",
    "волков",  "огров",
    "троллей", "циклопов",
    "фей", "гномов",
    "эльфов", "друидов",
    "единорогов", "фениксов",
    "кентавров", "горгулий",
    "грифонов", "минотавров",
    "гидр", "драконов",
    "разбойников", "кочевников",
    "призраков", "джиннов",
};
char* gSpellNames[SPELL_COUNT] = {
    "Огненный шар",  "Молния",
    "Телепортация",  "Лечение",
    "Воскрешение",  "Ускорение",
    "Замедление",  "Ослепление",
    "Благословение",  "Защита",
    "Проклятие", "Убить нежить",
    "Антимагия", "Снять чары",
    "Берсерк", "Армагеддон",
    "Шторм", "Звездопад",
    "Паралич", "Шахты",
    "Ресурсы", "Артефакты",
    "Города", "Герои",
    "Все", "Опознать героя",
    "Корабль", "Портал",
    "Врата города",
};
char* gNeutralBuildingNames[BUILDING_SLOT_NEUTRAL_COUNT] = {
    "Гильдия магов",
    "Гильдия воров",
    "Таверна",
    "Верфь",
    "Колодец",
    "Шатры",
    "Замок"
};
char* gDwellingNames[24] = {
    "Мазанка",  "Стрельбище",
    "Кузница",  "Оружейная",
    "Ристалище",  "Собор",
    "Древо-дом",  "Избушка",
    "Стрельбище",  "Стоунхендж",
    "Загон", "Алая башня",
    "Хижина", "Хибара",
    "Логово", "Дом огров",
    "Мост", "Пирамида",
    "Пещера", "Крипта",
    "Гнездо", "Лабиринт",
    "Болото", "Черная башня",
};
char* gTerrainNames[TERRAIN_COUNT] = {
    "Вода",
    "Трава",
    "Снег",
    "Болото",
    "Лава",
    "Пустыня",
    "Равнина"
};
char* gResourceNames[RESOURCE_COUNT] = {
    "Древесина",
    "Ртуть",
    "Руда",
    "Сера",
    "Кристаллы",
    "Самоцветы",
    "Золото"
};
char* gMineNames[RESOURCE_COUNT] = {
    "Лесопилка",
    "Лаборатория алхимика",
    "Рудная шахта",
    "Серная шахта",
    "Кристальная шахта",
    "Самоцветная шахта",
    "Золотоносная шахта"
};
char* gObjectNames[63] = {
    "",
    "Лаборатория алхимика",
    "Указатель",
    "Буй",
    "Скелет",
    "Пещера демона",
    "Ларец с сокровищами",
    "Кольцо фейри",
    "Костер",
    "Фонтан",
    "Беседка",
    "Древняя лампа",
    "Кладбище",
    "Лачуга",
    "Дом",
    "Будка",
    "Хижина",
    "Хижина",
    "Таверна 1",
    "Таверна 2",
    "Таверна 3",
    "Таверна 4",
    "Драконий город",
    "Маяк",
    "Водяная мельница",
    "Шахта",
    "Бивуак",
    "Обелиск",
    "Оазис",
    "Ресурсы",
    "Розовый куст",
    "Яма в песке",
    "Лесопилка",
    "Святилище",
    "Святилище",
    "Кораблекрушение",
    "Статуя",
    "Пень",
    "Лебединое озеро",
    "Шатры",
    "Город",
    "Менгир",
    "Фургоны",
    "Колодец",
    "Водоворот",
    "Ветряная мельница",
    "Дуб",
    "Мегалит",
    "Артефакт",
    "Тут ничего нет",
    "",
    "",
    "Горы",
    "Горы",
    "Горы",
    "Горы",
    "Деревья",
    "Деревья",
    "Деревья",
    "Деревья",
    "Деревья",
    "",
    "Корабль"
};
char* gTownNames[36] = {
    "Блэкбридж",  "Сосновый холм",
    "Вудхавен",  "Хилстон",
    "Вайтшилд",  "Бладрейн",
    "Клык дракона",  "Грейвинд",
    "Блэквинд",  "Портсмис",
    "Мидлгейт", "Тундара",
    "Вулкания", "Занзобар",
    "Атлантиум", "Байвоч",
    "Вилдабар", "Фонтанхед",
    "Вертиго", "Винтеркил",
    "Найтшэдоу", "Сэндкастер",
    "Лайксайд", "Олимпус",
    "Некрополис", "Бурлок",
    "Ксабран", "Драгадун",
    "Аламар", "Калиндра",
    "Блэкфанг", "Бесенжи",
    "Алгари", "Сорпигал",
    "Даск", "Эрликиум",
};
char* gEventText[77] = {
    "Алхимик\n\nВы стали хозяином лаборатории местного алхимика. Она будет приносить вам по 1 единице ртути в день.",  "Указатель\n\nНа указателе написано:\n\n%s находится неподалеку отсюда.",
    "Буй\n\nВаши спутники замечают морской буй. Он указывает верный курс.",  "Буй\n\nВаши спутники замечают морской буй. Он указывает верный курс, и это повышает их мораль.",
    "Влага оседает на стенах и тонкими струйками стекает на землю. Повсюду видны следы побоища, но больше в пещере ничего нет.",  "Огромный демон выступает из тени, и вы бросаетесь в атаку. Победив в нелегком поединке, вы получаете 1000 очков опыта.",
    "Огромный демон выступает из тени, и вы бросаетесь в атаку. Победив в нелегком поединке, вы поучаете 1000 очков опыта и волшебный артефакт.",  "Огромный демон выступает из тени, и вы бросаетесь в атаку. Победив в нелегком поединке, вы получаете 1000 очков опыта и 2500 золотых.",
    "Вы попали в плен к огромному демону. Он предлагает вам свободу в обмен на 2500 золотых. Если вы откажетесь, он сожрет вас. Будете платить?",  "Поняв, что у вас нет 2500 золотых, демон вонзает в вас свои жуткие когти. Ваш взор застилает кровавая пелена и мир погружается во тьму.",
    "Пещера демона\n\nИз пещеры веет промозглой затхлостью. Два огромных красных глаза светятся во тьме. Желаете войти внутрь?", "Ларец\n\nОбследовав окрестности, вы находите клад. Вы можете взять золото или раздать его крестьянам в обмен на опыт. Хотите взять золото?",
    "Кольцо фейри\n\nВаше войско вступает внутрь кольца фейри, но ничего не происходит.", "Кольцо фейри\n\nВаше войско вступает внутрь кольца фейри, чары которого принесут вам удачу в грядущем сражении.",
    "Костер\n\nОбыскав вражеский лагерь, вы находите спрятанный клад.", "Фонтан\n\nВы припадаете к струям волшебного фонтана, но ничего не происходит.",
    "Фонтан\n\nБлагоуханная влага волшебного фонтана принесет вам удачу в грядущем сражении.", "Беседка\n\nНа ступенях беседки появляется старый рыцарь. \"Мне жаль, храбрый воин, но я уже научил тебя всему, что знаю сам.\"",
    "Беседка\n\nНа ступенях беседки появляется старый рыцарь. \"О храбрый воин, я научу тебя всему, что знаю сам; пусть мой опыт поможет тебе в твоих странствиях.\"", "Лампа джинна\n\nВы находите засыпанную землей помятую и закопченную лампа. Хотите ее потереть?",
    "Кладбище\n\nВы осторожно приближаетесь к захоронению древних воинов. Хотите вскрыть их могилы?", "Одержав победу над призраками, вы несколько часов подряд обыскиваете могилы, но ничего не находите. Ваш недостойный поступок отрицательно влияет на мораль войска.",
    "Одержав победу над призраками, вы обыскиваете могилы и удаляетесь с находкой!", "Хижина\n\nГруппа гоблинов в поисках славы желает примкнуть к вашему войску. Согласны ли вы принять их?",
    "Вы не можете принять новых рекрутов в свое войско, его ряды полны.", "Хижина\n\nПриблизившись к жилищу гоблинов, вы обнаруживаете, что оно пустует.",
    "Мазанка\n\nГруппа крестьян в поисках славы желает примкнуть к вашему войску. Согласны ли вы принять их? ", "Вы не можете принять новых рекрутов в свое войско, его ряды полны.",
    "Мазанка\n\nПриблизившись к жилищу крестьян, вы обнаруживаете, что оно пустует.", "Избушка\n\nГруппа лучников в поисках славы желает примкнуть к вашему войску. Согласны ли вы принять их?",
    "Вы не можете принять новых рекрутов в свое войско, его ряды полны.", "Избушка\n\nПриблизившись к жилищу лучников, вы обнаруживаете, что оно пустует.",
    "Избушка\n\nГруппа гномов в поисках славы желает примкнуть к вашему войску. Согласны ли вы принять их?", "Вы не можете принять новых рекрутов в свое войско, его ряды полны.",
    "Избушка\n\nПриблизившись к жилищу гномов, вы обнаруживаете, что оно пустует.", "Мазанка\n\nГруппа крестьян в поисках славы желает примкнуть к вашему войску. Согласны ли вы принять их?",
    "Вы не можете принять новых рекрутов в свое войско, его ряды полны.", "Мазанка\n\nПриблизившись к жилищу крестьян, вы обнаруживаете, что оно пустует.",
    "Город драконов\n\nВы подошли к Городу драконов, славному своими богатствами и неисчислимыми опасностями. Вы хотите атаковать его?", "Вы одержали победу над могучими драконами. Отдавая должное вашей доблести, они готовы ежедневно платить в вашу казну по 1000 золотых и оборонять город от неприятелей.",
    "Маяк\n\nТеперь маяк ваш, и все ваши корабли будут преодолевать большее расстояние за один ход.", "Водяная мельница\n\nМельник обращается к вам со словами: \"Сожалею, господин, но сегодня золота у меня нет. Приходите на следующей неделе.\"",
    "Водяная мельница\n\nМельник обращается к вам со словами: \"Господин, я трудился в поте лица и прошу вас принять мою скромную лепту. Приходите на следующей неделе, и вы получите еще столько же.\"", "Рудная шахта\n\nВы стали хозяином рудной шахты. Она будет приносить вам по 2 единицы руды в день.",
    "Серные копи\n\nВы стали хозяином серных копей. Они будут приносить вам по 1 единице серы в день.", "Кристальная шахта\n\nВы стали хозяином кристальной шахты. Она будет приносить вам по одной мере кристаллов в день.",
    "Самоцветная шахта\n\nВы стали хозяином самоцветной шахты. Она будет приносить вам по 1 единице самоцветов в день.", "Золотая шахта\n\nВы стали хозяином золотой шахты. Она будет приносить вам по 1000 золотых в день.",
    "Последователи\n\nГруппа %s в поисках славы желает примкнуть к вашему войску. Вы согласны принять их?", "Оскорбленные отказом быть принятыми в ваши ряды, они нападают на вас!",
    "Обелиск\n\nПеред вами обелиск, высеченный из невиданного камня. Вы вглядываетесь в его гладкую поверхность и вдруг замечаете, что на ней начинают проступать таинственные знаки. Знаки складываются во фрагмент древней карты. Вы торопливо срисовываете его, и знаки исчезают так же внезапно, как и появились.", "Обелиск\n\nВы уже посещали этот обелиск.",
    "Оазис\n\nВы находите оазис, но его колодец пересох, и вы удаляетесь ни с чем.", "Оазис\n\nСтранствующий торговец, бредущий пешком, окликает вас и рассказывает, что его лошадь убежала и он остался один в чужом краю. В благодарность за помощь он приводит ваше войско к оазису, что повышает их мораль в грядущем сражении.",
    "Вы нашли ресурс (%s).", "Лесопилка\n\nВы стали хозяином лесопилки. Она будет приносить вам по 2 единицы древесины в день.",
    "Оракул\n\nВнутри величественного храма восседает слепой оракул. Вы рассказываете ему о целях вашего похода, и он показывает вам сильные и слабые стороны ваших противников в волшебном хрустальном шаре.", "Святилище\n\nВ центре небольшого храма, скрытого от чужих глаз, стоит старый деревянный алтарь. На алтаре покоится золотая пластина, на которой начертан секрет древнего магического заклинания ",
    "Разбитый корабль\n\nВолны прибили к скалам полузатонувший корпус большого пиратского корабля. Вы хотите заглянуть внутрь?", "Одержав победу над призраками, вы несколько часов подряд обыскиваете останки корабля, но ничего не находите. Ваш недостойный поступок отрицательно влияет на мораль войска.",
    "Одержав победу над призраками, вы обыскиваете останки корабля и удаляетесь с находкой!", "Статуя\n\nНад вами возвышается огромная статуя ангела. Внезапно ангел открывает глаза, и ваши воины с радостью ощущают, что их мораль возрасла.",
    "Статуя\n\nНад вами возвышается гигантская статуя ангела. Ваши воины окружают ее, но она остается мертвой и неподвижной.", "Шатры\n\nВаше внимание привлекает группа шатров, пологи которых трепещут на жарком ветру пустыни. В шатрах никого нет. Пройдет время, и быть может, сюда придет новый отряд кочевников.",
    "Шатры\n\nВаше внимание привлекает группа шатров, пологи которых трепещут на жарком ветру пустыни. Вы хотите принять в ваше войско отряд кочевников?", "Фургоны\n\nЯркие фургоны разбойников пусты. Пройдет время, и быть может, здесь обоснуется новая шайка.",
    "Фургоны\n\nВдалеке слышится музыка и смех. Вы идете на эти звуки и находите  яркие фургоны, в которых живут разбойники. Вы хотите принять в ваше войско шайку разбойников?", "Водоворот\n\nВаш корабль попадает в водоворот. Часть вашего войска исчезает в пучине.",
    "Ветряная мельница\n\nМельник обращается к вам со словами: \"Сожалею, господин, но сегодня у меня ничего нет. Приходите на следующей неделе.\"", "Ветряная мельница\n\n Мельник обращается к вам со словами: \"Господин, я работал не покладая рук, и прошу вас принять мой скромный дар. Приходите на следующей неделе, у меня опять найдется, чем вас порадовать.\"",
    "Артефакт\n\nВы находите древний артефакт. Вы направляетесь к нему, но дорогу вам преграждает шайка разбойников, готовых драться за свою добычу.", "Артефакт\n\nМаленький лепрекон предлагает вам %s в обмен на 2000 золотых. Вы хотите приобрести артефакт?",
    "Оскорбленный вашим отказом от такой выгодной сделки лепрекон в гневе топает ножкой и исчезает.", "Вы достаете кошель, но вдруг обнаруживаете, что у вас нет 2000 золотых. Лепрекон топает ножкой и с презрением поворачивается к вам спиной.",
    "Перебив разбойников, вы обыскиваете их трупы и обнаруживаете %s.", "Скелет\n\nВы обнаруживаете останки незадачливого искателя приключений. Пошарив в груде лохмотьев, прикрывающих скелет, вы ничего не находите.",
    "Скелет\n\nВы обнаруживаете останки незадачливого искателя приключений. Пошарив в груде лохмотьев, вы находите",
};
char* gAPanelHelp[5] = {
    "Осмотреть весь мир.",
    "Посмотреть головоломку.",
    "Направить заклинание.",
    "Копать в поисках Могущественного артефакта.",
    "Закрыть это меню ничего не делая.",
};
char* gInitMenuHelp[MAIN_MENU_HELP_COUNT] = {
    "Начать одиночную или сетевую игру.",
    "Загрузить сохраненную игру.",
    "Открыть таблицу рекордов.",
    "Посмотреть список авторов.",
    "Выйти из Героев Меча и Магии и вернуться в систему.",
};
char* gAdvMenuHelp[6] = {
    "Следующий герой\n\nВыбрать следующего героя.",
    "Продолжить движение \n\nПродолжить движение героя по намеченному пути.",
    "Обзор королевства\n\nОсмотреть ваши владения.",
    "Окончить ход\n\nОкончить ход и передать управление компьютеру.",
    "Игровые действия\n\nОткрывает окно игровых действий.",
    "Настройки игры\n\nОткрыть окно настроек игры.",
};
char* gLuckText[7] = {
    "Проклятая",
    "Ужасная",
    "Плохая",
    "Обычная",
    "Хорошая",
    "Отличная",
    "Божественная",
};
char* gMoraleText[7] = {
    "Предательская",
    "Ужасная",
    "Плохая",
    "Обычная",
    "Хорошая",
    "Отличная",
    "Кровавая!",
};
char* onOffText[11] = {
    "Выкл.",
    "Вкл.",
    "Вкл.\nГромкость 9",
    "Вкл.\nГромкость 8",
    "Вкл.\nГромкость 7",
    "Вкл.\nГромкость 6",
    "Вкл.\nГромкость 5",
    "Вкл.\nГромкость 4",
    "Вкл.\nГромкость 3",
    "Вкл.\nГромкость 2",
    "Вкл.\nГромкость 1"
};
char* walkSpeedText[5] = {
    "Шагом",
    "Рысью",
    "Аллюром",
    "Галопом",
    "Прыжками"
};
char* gColorNames[PLAYER_COLOR_COUNT] = {
    "синий",
    "зеленый",
    "красный",
    "желтый"
};
char* gAlignmentNames[5] = {
    "люди",
    "равнинные",
    "лесные",
    "горные",
    "нейтральные"
};
char* gSpellDesc[SPELL_COUNT] = {
    "Огненный шар\n\nОгромный огненный шар взрывается над выбранным участком поля боя, поражая всех находящихся поблизости участников сражения.",  "Молния\n\nМощный электрический разряд поражает выбранную группу воинов.",
    "Телепортация\n\nПереносит выбранную группу воинов в любое свободное место на поле боя.",  "Лечение\n\nНейтрализует все враждебные чары, насланные на ваших воинов.",
    "Воскрешение\n\nВоскрешает воинов в группе, которой был нанесен урон.",  "Ускорение\n\nСкорость любой группы воинов становится 'очень высокой'.",
    "Замедление\n\nУменьшает скорость даже самой быстрой группы вражеских воинов.",  "Ослепление\n\nЗатуманивает взоры воинов в выбранной группе и тем самым не позволяет им перемещаться по полю боя.",
    "Благословение\n\nУвеличивает до максимума урон, наносимый выбранной группой воинов.",  "Защита\n\nУвеличивает навык защиты воинов выбранной группы.",
    "Проклятие\n\nУменьшает до минимума урон, причиняемый выбранной группой воинов.", "Убить нежить\n\nМгновенно загоняет призраков в покинутые ими могилы.",
    "Антимагия\n\nДелает невозможным применение враждебных чар против выбранной группы воинов.", "Снять чары\n\nНейтрализует любые чары, насланные на всех участников сражения.",
    "Берсерк\n\nЗаставляет выбранную группу воинов нападать на ближайшую к ней соседнюю группу.", "Армагеддон\n\nМогущественные силы поражают всех участников сражения, нанося им жестокий урон.",
    "Шторм\n\nСилы стихий обрушиваются на поле боя, нанося урон всем участникам сражения.", "Звездопад\n\nЗвездопад поражает выбранный участок поля боя, нанося урон всем находящимся поблизости участникам сражения.",
    "Паралич\n\nГруппу, против которой направлено это заклинание, поражает паралич, и она теряет способность передвигаться или отвечать на удары.", "Шахты\n\nДелает видимыми все шахты на игровой карте.",
    "Ресурсы\n\nДелает видимыми все ресурсы на игровой карте.", "Артефакты\n\nДелает видимыми все артефакты на игровой карте.",
    "Города\n\nДелает видимыми все города и замки на игровой карте.", "Герои\n\nДелает видимыми всех героев на игровой карте.",
    "Все\n\nДелает видимой всю игровую карту.", "Опознать героя\n\nПозволяет получить подробную информацию о вражеских героях.",
    "Корабль\n\nПереносит ближайший незанятый дружественный корабль в соответствующую точку побережья. Дружественным считается корабль, который вы только что построили, либо тот, на котором после вас никто не плавал.", "Портал\n\nПереносит вас в точку на карте, расположенную поблизости.",
    "Врата города\n\nПереносит вас в любой принадлежащий вам город или замок.",
};
char* gMonthNames[10] = {
    "Кузнечика",
    "Муравья",
    "Стрекозы",
    "Паука",
    "Бабочки",
    "Шмеля",
    "Цикады",
    "Земляного червя",
    "Шершня",
    "Жука",
};
char* gWeekNames[15] = {
    "Белки",
    "Кролика",
    "Суслика",
    "Барсука",
    "Крысы",
    "Орла",
    "Горностая",
    "Ворона",
    "Мангуста",
    "Собаки",
    "Муравьеда",
    "Ящерицы",
    "Черепахи",
    "Дикобраза",
    "Кондора",
};
char* gDwellingDescriptions[24] = {
    "В Мазанке покупают крестьян.",
    "На Стрельбище покупают лучников.",
    "В Кузнице покупают копейщиков.",
    "Оружейная позволяет покупать мечников.",
    "На Ристалище покупают всадников.",
    "В Соборе покупают паладинов.",
    "В Древо-доме покупают фей.",
    "В Коттеджах покупают гномов.",
    "На Стрельбище покупают эльфов.",
    "В Стоунхендже покупают друидов.",
    "В Загоне покупают единорогов.",
    "В Алой башне покупают фениксов.",
    "В Хижине покупают гоблинов.",
    "В Хибаре покупают орков.",
    "В Логове покупают волков.",
    "В Доме огров покупают огров.",
    "Под Мостом покупают троллей.",
    "В Пирамиде покупают циклопов.",
    "В Пещере покупают кентавров.",
    "В Крипте покупают горгулий.",
    "В Гнезде покупают грифонов.",
    "В Лабиринте покупают Минотавров.",
    "В Болоте покупают гидр.",
    "В Черной башне покупают драконов.",
};
char* gArmySizeNames[6][2] = {
    {"Мало", "Мало"},
    {"Немного", "Немного"},
    {"Свора", "Свора"},
    {"Много", "Много"},
    {"Орда", "Орда"},
    {"Тьма!", "Тьма"},
};
char* gHeroScreen[HERO_TEXT_COUNT] = {
    "Обзор королевства",  "%s - информация",
    "Дополнительная статистика героя",  "Информация о высокой морали",
    "Информация об обычной морали",  "Информация о плохой морали",
    "Информация о хорошей удаче",  "Информация об обычной удаче",
    "Информация о плохой удаче",  "Показать опыт",
    "Отряд %s", "Пусто",
    "Передвинуть сюда отряд %s", "Отряды %s и %s меняются местами",
    "Показать заклинания", "Описание артефакта '%s'",
    "%s %s будет уволен(а)?", "Закрыть экрана героя",
    "Экран героя",
};
char* gCastleInfo[14] = {
    "Построить Гильдию магов",
    "Построены все этажи Гильдии магов.",
    "Нельзя построить следующий этаж.",
    "Построить следующий этаж Гильдии магов ",
    "Постройка '%s' уже возведена",
    "Нельзя возвести постройку '%s'",
    "Нельзя возвести постройку '%s'",
    "Возвести постройку '%s'",
    "Герой вам не по карману.",
    "Нельзя нанять - у вас уже %d героев.",
    "Нельзя нанять - в этом городе у вас уже есть герой.",
    "Нанять нового героя ",
    "Выйти из замка",
    "Возможности замка",
};
char* gLuckInfoText[LUCK_INFO_COUNT] = {
    "Хорошая удача\n\nЕсли удача вашего войска выше обычной, атаки отдельных отрядов на поле боя иногда оказываются более результативными (их сила удваивается).",
    "Обычная удача\n\nС обычной удачей ваше войско не имеет ни преимуществ, ни недостатков на поле боя.",
    "Плохая удача\n\nЕсли вашему войску не везет, урон, наносимый  отдельными отрядами на поле боя, может оказаться вдвое меньше обычного.",
    "%s\n\n\nТекущие компоненты удачи:",
    "\nЛапка кролика +1",
    "\nПодкова +1",
    "\nМонета +1",
    "\nКлевер +1",
    "\nКруг фейри +1",
    "\nФонтан +1",
    "\nнет",
};
char* gMemoryErrorTitle = "Не хватает памяти";
char* gMemoryRequirements = "Игре Герои Меча и Магии требуется как минимум:";
char* gExtendedMemoryUnits = "Кб верхней памяти (XMS или EMS) и";
char* gConventionalMemoryUnits = "Кб общей памяти ";
char* gPlayerTypeNames[5] = {
    "Нет",
    "Глупый",
    "Средний",
    "Умный",
    "Гений"
};
char* gSpellHelp[SPELL_HELP_COUNT] = {
    "Предыдущая страница ",
    "Следующая страница",
    "Путевые заклинания",
    "Боевые заклинания",
    "Закрыть магическую книгу",
    "Заклинания",
    "Выбрать заклинание",
    "Боевые заклинания",
};
char* gSpeedText[5] = {
    "",
    "Низкая",
    "Средняя",
    "Высокая",
    "Оч. высокая",
};
char* gArmyStatText[9] = {
    "Атака: ",
    "Защита: ",
    "Выстрелов: ",
    "Урон: ",
    "Здоровье: ",
    "Скорость: ",
    "Мораль: ",
    "Удача: ",
    "Стрел: ",
};
char* gOverviewText[3] = {
    "Обзор королевства     Месяц: %d, Неделя: %d, День: %d",
    "Ваш Драконий город.",
    "Ваш маяк.",
};
char* gNewTurnText[7] = {
    "%s игрок, у вас осталось всего %d дней на то, чтобы завоевать хотя бы один город; иначе вы будете навеки изгнаны из страны.",
    "%s игрок, настал последний день, когда вы еще можете завоевать себе город; в противном случае вы будете навеки изгнаны из страны.",
    "Астрологи объявляют месяц %s.\n\nНаселение всех жилищ возросло.",
    "Астрологи объявляют, что этому месяцу покровительствует сила %s.\n\nПопуляция %s удваивается!\n\nНаселение всех жилищ возросло.",
    "Астрологи объявляют месяц ЧУМЫ!\n\nНаселение всех жилищ уменьшилось вдвое.",
    "Астрологи объявляют неделю %s.\n\nНаселение всех жилищ возросло.",
    "Астрологи объявляют, что этой неделе покровительствует сила %s.\n\nПопуляция %s +5.\n\nНаселение всех жилищ возросло.",
};
char* gViewGeneralLabels[6] = {
    "Атака: ",
    "Защита: ",
    "Сила магии: ",
    "Знания: ",
    "Мораль: ",
    "Удача: ",
};
char* gViewGeneralHelp[GENERAL_HOVER_HELP_COUNT] = {
    "Остановить катапульту",
    "Направить заклинание",
    "Отступить",
    "Сдаться",
    "Отмена",
    "Возможности героя",
};
char* gCombatMessage[9] = {
    "",
    "%s - идти сюда.",
    "%s - перелететь сюда.",
    "Атаковать %s",
    "Стрелять в %s (осталось %d выстрелов)",
    "Возможности героя",
    "Вражеский герой",
    "Информация о воине (%s)",
    "Нет стрел!",
};
char* gHeroLevel[HERO_LEVEL_TEXT_COUNT] = {
    "%s получает",
    " уровень опыта.\n",
    " %d уровня опыта.\n"
};
char* gCombatHelp[3] =
    {"Включить автобой", "Пропустить ход отряда", ""};
char* gTownCommand[22] = {
    "Разделить отряд %s",  "Нельзя забрать последних воинов у героя ",
    "Соединить отряды %s",  "Разделить отряд %s",
    "Отряд %s",  "Нельзя перенести в гарнизон последний отряд.",
    "Передвинуть сюда отряд %s",  "Отряды %s и %s меняются местами",
    "Выйти из города",  "",
    "Обзор королевства", "Пусто",
    "Отряд %s", "Показать героя",
    "Гильдия магов", "Гильдия воров",
    "Таверна", "Верфь",
    "Колодец", "Шатры",
    "Замок", "Нанять %s",
};
char* gGameTypeHelp[5] = {
    "Играть одиночный сценарий против компьютерных оппонентов.",
    "Играть кампанию, состоящую из серии отдельных сценариев.",
    "Играть против других игроков-людей на одном компьютере, по сети или модему.",
    "Играть тренировочную игру.",
    "Отменить и вернуться в главное меню.",
};
char* gHeroNames[36][2] = {
    {"Лорд Килбурн", "Килбурн"},
    {"Лорд Хаарт", "Хаарт"},
    {"Сэр Галлант", "Галлант"},
    {"Артуриус", "Артуриус"},
    {"Тиро", "Тиро"},
    {"Максимус", "Максимус"},
    {"Эктор", "Эктор"},
    {"Димитрий", "Димитрий"},
    {"Амброзий", "Амброзий"},
    {"Сундакс", "Сундакс"},
    {"Эргон", "Эргон"},
    {"Келзен", "Келзен"},
    {"Тсабу", "Тсабу"},
    {"Крэг Хак", "Крэг"},
    {"Джоджош", "Джоджош"},
    {"Атлас", "Атлас"},
    {"Йог", "Йог"},
    {"Антоний", "Антоний"},
    {"Ариэль", "Ариэль"},
    {"Ватавна", "Ватавна"},
    {"Карлавн", "Карлавн"},
    {"Ребекка", "Ребекка"},
    {"Луна", "Луна"},
    {"Астра", "Астра"},
    {"Наташа", "Наташа"},
    {"Гем", "Гем"},
    {"Троян", "Троян"},
    {"Агар", "Агар"},
    {"Кродо", "Кродо"},
    {"Фалагар", "Фалагар"},
    {"Барок", "Барок"},
    {"Арий", "Арий"},
    {"Кастор", "Кастор"},
    {"Сандро", "Сандро"},
    {"Расмонт", "Рас"},
    {"Виспер", "Виспер"},
};
char* gCPanelHelp[12] = {
    "Начать одиночную или сетевую игру.",
    "Загрузить ранее сохраненную игру.",
    "Выйти из Героев Меча и Магии и вернуться в ОС.",
    "Выйти из этого меню, ничего не делая.",
    "Сохранить данную игру.",
    "Включить или выключить музыку",
    "Включить или выключить фоновые звуки",
    "Изменить скорость передвижения героев по карте.",
    "Изменить качество звука. CD-стерео имеет наилучшее качество, и, как правило, не снижает производительность системы. Однако некоторые системы не способны воспроизводить звук с компакт-диска; тогда приходится использовать 8-битный звук.",
    "Вкл./Выкл. 'Показать путь'. Если опция отмечена, первый щелчок по объекту на игровой карте показывает путь до него, а по второму щелчку начинается движение. Если эта опция отключена, движение к заданной точке начинается по первому щелчку мыши.",
    "Включение/выключение режима 'Показать перемещения противника'. Если этот режим включен, будут показаны перемещения всех противников на открытой части игровой карты. Следует иметь в виду, что при игре по сети или модему этот режим автоматически отключается.",
    "Показать информацию о текущем сценарии."
};
char* gNewGameHelp[NEW_GAME_HELP_COUNT] = {
    "Принять установки и начать игру.",
    "Вернуться в главное меню.",
    "Бросить вызов 'Царь горы' компьютерным игрокам. Ваша наглая выходка оскорбит компьютерных игроков и они, оставив друг друга в покое, будут стремиться разгромить вас в прах.",
    "Выберите сценарий, на котором хотите играть.",
    "Изменить начальную сложность игры. Чем больший уровень сложности вы выберете, тем с меньшим количеством ресурсов вы начнете игру.",
    "Изменить уровень сложности для этого соперника. Более умные компьютерные игроки ведут себя более агрессивно и тратят больше времени на ход.",
    "Изменить цвет вашего знамени.",
    "Уровень сложности отражает соотношение различных параметров игры. Указанное количество очков будет прибавлено к вашему финальному счету.",
    "Изменить стартовую сложность игры другого игрока. Чем больший уровень сложности вы выберете, тем с меньшим количеством ресурсов вы начнете игру.",
};
char* gSetupCampaignGameHelp[SETUP_CAMPAIGN_HELP_COUNT] = {
    "Играть за Лорда Айронфиста.",
    "Играть за Вождя Слэйера.",
    "Играть за Царицу Ламанду.",
    "Играть за Колдуна Аламара.",
    "Отменить и вернуться в главное меню.",
};
char* gSetupBaudHelp[SETUP_BAUD_HELP_COUNT] = {
    "Скорость соединения 2400 бод. \n\nДля модемов со скоростью 14400 бод используйте скорость 19200 бод. Для модемов со скоростью 28800 бод используйте скорость 38400 бод.",
    "Скорость соединения 9600 бод. \n\nДля модемов со скоростью 14400 бод используйте скорость 19200 бод. Для модемов со скоростью 28800 бод используйте скорость 38400 бод.",
    "Скорость соединения 19200 бод.\n\nДля модемов со скоростью 14400 бод используйте скорость 19200 бод. Для модемов со скоростью 28800 бод используйте скорость 38400 бод.",
    "Скорость соединения 38400 бод.\n\nДля модемов со скоростью 14400 бод используйте скорость 19200 бод. Для модемов со скоростью 28800 бод используйте скорость 38400 бод.",
    "Отменить и вернуться в главное меню.",
};
char* gSetupComPortHelp[SETUP_COM_PORT_HELP_COUNT] = {
    "Использовать порт COM 1 для модемного соединения.",
    "Использовать порт COM 2 для модемного соединения.",
    "Использовать порт COM 3 для модемного соединения.",
    "Использовать порт COM 4 для модемного соединения.",
    "Отменить и вернуться в главное меню.",
};
char* gSetupDCBaudHelp[SETUP_BAUD_HELP_COUNT] = {
    "Скорость соединения 2400 бод. \n\nДля компьютеров с устаревшим чипом UART 8250 следует использовать скорость 19200 бод, а для компьютеров с более современным чипом UART 16550 - скорость 38400 бод. Если вы не уверены, какой у вас чип, начните с более низких скоростей. В большинстве компьютеров, произведенных в 1994 году и позднее, используется чип UART 16550.",
    "Скорость соединения 9600 бод. \n\n Для компьютеров с устаревшим чипом UART 8250 следует использовать скорость 19200 бод, а для компьютеров с более современным чипом UART 16550 - скорость 38400 бод. Если вы не уверены, какой у вас чип, начните с более низких скоростей. В большинстве компьютеров, произведенных в 1994 году и позднее, используется чип UART 16550.",
    "Скорость соединения 19200 бод.\n\n Для компьютеров с устаревшим чипом UART 8250 следует использовать скорость 19200 бод, а для компьютеров с более современным чипом UART 16550 - скорость 38400 бод. Если вы не уверены, какой у вас чип, начните с более низких скоростей. В большинстве компьютеров, произведенных в 1994 году и позднее, используется чип UART 16550.",
    "Скорость соединения 38400 бод.\n\n Для компьютеров с устаревшим чипом UART 8250 следует использовать скорость 19200 бод, а для компьютеров с более современным чипом UART 16550 - скорость 38400 бод. Если вы не уверены, какой у вас чип, начните с более низких скоростей. В большинстве компьютеров, произведенных в 1994 году и позднее, используется чип UART 16550.",
    "Отменить и вернуться в главное меню. ",
};
char* gSetupDCComPortHelp[SETUP_COM_PORT_HELP_COUNT] = {
    "Использовать порт COM 1 для прямого соединения.",
    "Использовать порт COM 2 для прямого соединения.",
    "Использовать порт COM 3 для прямого соединения.",
    "Использовать порт COM 4 для прямого соединения.",
    "Отменить и вернуться в главное меню.",
};
char* gSetupHotSeatGameHelp[SETUP_HOT_SEAT_HELP_COUNT] = {
    "Играть с 2 людьми и, опционально, до 2 дополнительных компьютерных игроков.",
    "Играть с 3 людьми и, опционально, с 1 компьютерным игроком.",
    "Играть с 4 людьми.",
    "Отменить и вернуться в главное меню.",
};
char* gSetupModemGameHelp[SETUP_MODEM_HELP_COUNT] = {
    "Хост определяет настройки игры, выбирает номер дозвона и размещает вызовы.",
    "Гость ожидает вызова хоста.",
    "Изменить настройки модема.",
    "Отменить и вернуться в главное меню.",
};
char* gSetupDCGameHelp[SETUP_MODEM_HELP_COUNT] = {
    "Хост задает настройки игры.",
    "Гость ожидает, пока хост определит опции игры.",
    "Изменить порт прямого соединения.",
    "Отменить и вернуться в главное меню.",
};
char* gSetupMultiPlayerGameHelp[SETUP_MULTIPLAYER_HELP_COUNT] = {
    "Играть за одним компьютером, где от 2 до 4 игроков сражаются за одной машиной, меняясь по очереди местами при передаче хода.",
    "Играть по локальной сети, где машины 2 игроков соединены между собой.",
    "Играть по модему, где 2 игрока используют свои компьютеры, соединенные между собой по телефонной линии с использованием модема.",
    "Играть через прямое соединение, где 2 игрока играют на машинах соединенных через порты по ноль-модему.",
    "Отменить и вернуться в главное меню.",
};
char* gSetupNetworkGameHelp[SETUP_NETWORK_HELP_COUNT] = {
    "Сервер задает настройки игры. Может быть, только один хост в одном сетевом соединении.",
    "Гость ожидает, пока сервер задаст настройки игры, после чего он автоматически вступит в игру. В игре по сети может быть только 1 гость.",
    "Отменить и вернуться в главное меню.",
};
char* gSetupGameHelp[SETUP_GAME_HELP_COUNT] = {
    "Одиночная игра на отдельной карте.",
    "Одиночная игра на серии карт.",
    "Сетевая игра, где несколько игроков-людей сражаются друг против друга на одной карте.",
    "Отменить и вернуться в главное меню.",
};
char* gBattleResults[11] = {
    "Враг сдался!",
    "Враг повержен!",
    "Великая победа!",
    "\n\nЗа мужество, проявленное в бою, %s получает %d оч. опыта.",
    "%s сдается врагу и отступает с позором.",
    "%s трусливо бежит с поля боя.",
    "Ваши войска потерпели поражение и %s покидает вас.",
    "Ваши силы сдались врагу и отступили с позором.",
    "Ваши трусливые войска бежали с поля боя.",
    "Ваши войска потерпели поражение.",
    "\n\nЗа мужество, проявленное в бою, %s получает %d оч. опыта, и получает %d уровень(я).",
};
char* gNeutralBuildingDescriptions[BUILDING_SLOT_NEUTRAL_COUNT] =
    {
        "Гильдия магов позволяет разучивать новые заклинания.",
        "Гильдия воров дает информацию о врагах. Также, Гильдия воров дает разведывательную информацию о вражеских городах.  Дополнительные гильдии дают дополнительную информацию.",
        "Таверна увеличивает мораль бойцов, защищающих замок.",
        "Верфь позволяет строить корабли.",
        "Колодец увеличивает прирост всех воинов на 2 в неделю.",
        "Шатры дают рабочих, которые могут возвести замок.",
        "Замок улучшает защиту города и увеличивает доход.",
};
char* gMoraleInfoText[MORALE_INFO_COUNT] = {
    "Высокая мораль\n\nВысокая мораль может дать в бою вашим бойцам дополнительную атаку.",  "Обычная мораль\n\nС обычной моралью ваши армии никогда не получат дополнительную атаку и не будут прокляты.",
    "Низкая мораль\n\nНизкая мораль может привести к потере хода в бою вашими бойцами.",  "%s\n\n\nМодификаторы морали:",
    "\nБонус рыцаря +1",  "\nВсе %s бойцы +1",
    "\nВоины 3 рас -1",  "\nВоины 4 рас -2",
    "\nМедаль отваги +1",  "\nМедаль мужества +1",
    "\nМедаль доблести +1", "\nМедаль почета +1",
    "\nСимвол неудачи -2", "\nПосещен буй +1",
    "\nПосещен оазис +1", "\nПосещена статуя +2",
    "\nРасхититель гробниц -1", "\nРасхититель обломков -1",
    "\nТрусость в бою %d", "\nНет",
    "\nВоины 5 рас -3",
};
char* gMapSizeNames[MAP_SIZE_COUNT] = {
    "Маленькая",
    "Средняя",
    "Большая",
};
char* gMapDifficultyNames[MAP_DIFFICULTY_COUNT] = {
    "Легкая",
    "Обычная",
    "Тяжелая",
    "Невозможная",
    "Невероятная",
};
char* gCampaignScenarioNames[9] = {
    "Вы захватили плацдарм в новой стране. Вместе с вами еще три славных героя вступили в жестокий спор за обладание маленьким островком. Всех вас влечет к его центру - городу Предвратье. Город стоит посреди острова, и обладание им равносильно победе. Берегитесь дракона, который стережет подступы к Предвратью!",
    "Путь к материку преграждает Архипелаг Древних. Он состоит из четырех островов, каждым из которых владеет один правитель. Все четыре властителя должны быть разгромлены, и сделать это надо сейчас или никогда! Конечно, вам не обойтись без кораблей, но пользуйтесь ими мудро.",
    "Страна погрузилась в водоворот кровавой бойни. Но люди готовы пойти за героем, который овладеет Оком Гороса. Артефакт был захоронен и потерян в стародавние времена. Первый, кто отыщет Око, объединит народы и покорит эту землю.",
    "Теперь соседи видят в вас серьезного соперника. Все они стремятся завоевать центральный континент. Земля огромна, а враги далеко. Но здесь мало ресурсов, и они сильно охраняются. Вы должны победить всех и стать хозяином целого материка.",
    "Страна рыцарей, которой правит Лорд Айронфист, разделена извилистой Половодной рекой. Айронфист надеется, что она защитит его. Единственный прибрежный город, где есть верфь, находится далеко на востоке. Вы победите. Если захватите замок Айронфиста на северо-западе.",
    "Далеко на севере, за Непроходимой пустыней, лежат Мерзлые пустоши. Там обосновался Вождь Слэйер - кровожадный предводитель варварских кланов. Как только заставы в ущелье падут, орды варваров хлынут на юг. Замок Вождя Слэйера стоит к северо-востоку от ущелья.",
    "Предупрежденная о вашем приближении, Царица Ламанда сотворила заклятье, затопившее подходы к единственному порту. Вы должны найти портал, чтобы захватить порт. Единственный участок суши доступный для высадки находится на северо-востоке. Оттуда вам надо пробиваться к замку на северо-западе.",
    "Замок чернокнижников стоит в кратере вулкана. Чтобы пробиться к замку Колдуна Аламара, вам следует пройти через Лабиринт Минотавра. Маги уверены в своей неуязвимости и не ожидают атаки. Горгульи поджидают вас на истинной дороге к выходу из Лабиринта.",
    "Великая победа не за горами, но поверженные лорды еще опасны! Они объединили остатки своих сил и двинули несметные рати на ваши замки. Если вы укротите драконов, мятежные лорды сложат оружие. Захватите Драконий город на центральном острове и победа будет в ваших руках!",
};
char* gCampaignWinTexts[9] = {
    "Предвратье в ваших руках! Враги оставили свои замки на произвол судьбы и позорно бежали. Они нашли себе новые земли и снова копят силы. Промедление смерти подобно!",
    "Архипелаг Древних покорен и присоединен к вашим владеньям. За горизонтом лежит обширный неисследованный враждебный континент.",
    "Целительная сила Ока Гороса возрождает измученную землю. Люди собираются под ваши знамена, а противники отступают. Грядет война за власть над миром!",
    "Победа осталась за вами, враги расползлись по своим логовам. Вам еще предстоит захватить их родовые замки, по одному выкуривая их из насиженных нор.",
    "Сопротивление рыцарей сломлено! Их страна лежит у ваших ног.",
    "Замок варваров взят штурмом, а их армии разбиты!",
    "Вы пробились через лесной лабиринт и сравняли с землей замок Ламанды.",
    "Вы преследовали горгулий до самого замка Колдуна Аламара и повергли в прах чернокнижников.",
    "Драконы встают под ваши знамена, и мятежные лорды молят о пощаде. Теперь вы и только вы - великий властелин единой и необозримой страны!",
};
char* gCampaignScenarioText[9] = {
    "Предвратье",
    "Архипелаг",
    "Больные земли",
    "Свобода любой ценой",
    "Замок Айронфиста",
    "Замок Слэйера",
    "Замок Ламанды",
    "Замок Аламара",
    "Царь горы",
};
char* gDifficultyNames[DIFFICULTY_COUNT] = {
    "Легкая",
    "Обычная",
    "Тяжелая",
    "Эксперт",
};
char* gCampaignSideNames[4] = {
    "Лорд Айронфист",
    "Вождь Слэйер",
    "Царица Ламанда",
    "Колдун Аламар"
};
char* gScoreLabels[CONGRATS_SCORE_LABEL_COUNT] = {
    "Дней:",
    "Очки:",
    "Сложность:",
    "Счет:",
    "Ранг:",
};
char* gHumanPlayerTypeNames[5] = {
    "Человек\n",
    "Человек\nЛегкая игра",
    "Человек\nОбычная игра",
    "Человек\nТяжелая игра",
    "Человек\nЭксперт"
};
char* gHandicapNames[5] = {
    "Чел.-",
    "Чел.-Легкая игра",
    "Чел.-Обычная игра",
    "Чел.-Тяжелая игра",
    "Чел.-Эксперт"
};
char* musicQualityText[3] = {
    "8 бит моно",
    "8 бит стерео",
    "CD стерео"
};

i32 gDebugLevel;
mouseManager* gMouseManager;
char gText[768];
class font* gBigFont;
char* gDefaultAggregateName;
SMapHeader* gMapHeader;
i32 gSelectionWidth;
heroWindowManager* gWindowManager;
editManager* gEditManager;
char gStatusText[EDITOR_STATUS_TEXT_CAPACITY];
i32 gSelectionY;
resourceManager* gResourceManager;
heroWindow* gNormalDialogWindow;
heroWindow* gEditDialog;
i32 gSelectionHeight;
i32 gUnusedData451f84;
i8 gGroundToTerrain[140];
char gLastFilename[FILE_REQUESTER_NAME_SIZE];
i32 gStatusTextHoldTime;
i16 gMapX;
i16 gMapY;
mapCell* gEditCell;
palette* gBufferPalette;
palette* gPalette;
char gAggPathName[352];
char gRegAppPath[352];
i32 gMaxExtentX;
i32 gMaxExtentY;
i32 gUnusedCount452450;
i32 gUnusedCount452454;
inputManager* gInputManager;
i16 gNextObjectId;
configStruct gConfig;
i32 gOldKBMask;
i32 gMinExtentX;
i32 gMinExtentY;
executive* gExec;
i32 gLandCellCount;
char gLastMapName[352];
i32 gCurWindowsStyleFlags;
char gRegCDRomPath[352];
i32 gTimers[GLOBAL_TIMER_COUNT];

char gCurMapName[16] = "";
b32 gComputeExtent = false;
b32 gCurrArmyDrawn = false;
b8 gIconClipOn = false;
b32 gLimitToExtent = false;
b32 gLoadingMonoIcon = false;
b32 gSaveBiggestExtent = false;
i32 gColorMice = 0;
i32 gSpecialMouseMasks = 0;
i32 gUnusedData4528ac = 0;
i32 gScrollX = 0;
i32 gScrollY = 0;
HMENU gDefaultMenu = NULL;
HMENU gCombatMenu = NULL;
HMENU gAdventureMenu = NULL;
HMENU gTownMenu = NULL;
i32 gOverlayCategory = 0;
i32 gOverlayShownCategory = 0;
b32 gStatusTextShown = false;
b32 gInDialog = false;
i32 gMinimized = 0;
b32 gInSetupDialog = false;
i32 gSaveUnseen = 0;
b32 gGeneratingUnseen = false;
b32 gHeroMoving = false;
b32 gInSmacker = false;
i32 gStatusTextClearTime = 0;
b8 gFirstTimeThrough = false;

void EditorStartupHook(void) {}

void PollSound() {}

i32 oldmain(void) {
    palette* editorPalette;

    if ((gExec->InitSystem()))
        ShutDown("Не могу инициировать систему");
    KBChangeMenu(gDefaultMenu);
    editorPalette = gResourceManager->GetPalette("kb.pal");
    PostprocessPalette(editorPalette->m_data);
    gMapX = 0;
    gMapY = 0;
    gWindowManager->FadeScreen(WINDOW_FADE_OUT, WINDOW_FADE_NORMAL, editorPalette);
    if ((gExec->AddManager(gEditManager, BASE_MANAGER_PRIORITY_UNASSIGNED)))
        ShutDown("Не могу добавить менеджера!");
    gWindowManager->FadeScreen(WINDOW_FADE_IN, WINDOW_FADE_SHORT, editorPalette);
    gExec->MainLoop();
    gExec->RemoveManager(gEditManager);
    gWindowManager->FadeScreen(WINDOW_FADE_OUT, WINDOW_FADE_SHORT, editorPalette);
    gResourceManager->Dispose(editorPalette);
    ShutDown(NULL);
    return EXIT_SUCCESS;
}

void IncrementArgumentA(i32 value) {
    value++;
}

void EditorIdleHook(void) {}

void IncrementArgumentB(i32 value) {
    value++;
}

void DelayTicks(i32 ticks) {
    i32 unused = 0;

    gTimers[DELAY_TICKS_TIMER_SLOT] = KBTickCount() + ticks * DELAY_TICK_MILLISECONDS;
    DelayTil(gTimers + DELAY_TICKS_TIMER_SLOT);
}

void DelayTil(i32* endTime) {
    H1_ASSERT(*endTime > 10000);
    while (*endTime > KBTickCount()) {
        Process1WindowsMessage();
        PollSound();
    }
}

void DelayMilli(i32 delay) {
    DelayTilMilli(KBTickCount() + delay);
}

void DelayTilMilli(i32 endTime) {
    while (endTime > KBTickCount()) {
        Process1WindowsMessage();
        PollSound();
    }
}

void FileError(char* filename) {
    char message[200];
    sprintf(message, "Ошибка открытия файла %s!", filename);
    ShutDown(message);
}

void ShutDown(char* message) {
    char buffer[300];
    if (message) {
        strcpy(buffer, message);
        SetFullScreenStatus(FALSE);
        MessageBoxA(gAppWindow, buffer, "Неожиданное прерывание программы", MB_ICONHAND);
    }
    gClosingApp = true;
    gExec->ShutDownSystem();
    if (gEventHandle) {
        CloseHandle(gEventHandle);
        gEventHandle = NULL;
    }
    DeleteMainClasses();
    AppExit();
    exit(EXIT_SUCCESS);
}

b32 InterpretCommandLine(void) {
    i32 size;
    i32 i;

    gSpecialMouseMasks = 1;
    gDebugLevel = DEBUG_LEVEL_NONE;
    size = strlen(gCommandLine);
    for (i = 0; i < size; i++) {
        if (gCommandLine[i] == '/' && i + 1 < size) {
            switch (toupper(gCommandLine[i + 1])) {
                case 'D':
                    if (i + 2 < size)
                        gDebugLevel = gCommandLine[i + 2] - '0';
                    break;
                case 'B':
                    if (i + 2 < size)
                        gSpecialMouseMasks = gCommandLine[i + 2] - '0';
                    break;
            }
        }
    }
    gCommandLineInterpreted = true;
    return true;
}

b32 EarlySetup(void) {
    static b8 gEarlySetupDone = false;
    i32 i;

    if (gEarlySetupDone)
        return false;
    sprintf(gAggPathName, "%s%s", gDataPath, "heroes.agg");
    gDefaultAggregateName = gAggPathName;
    InitMainClasses();
    GetGraphicsInfo();
    ReadPrefs();
    if (!InterpretCommandLine())
        return true;
    switch (SetupCDDrive()) {
        case CD_SETUP_NO_DRIVE:
            MessageBoxA(
                gAppWindow,
                "Нет доступа к CD приводу.",
                "Ошибка загрузки",
                MB_ICONHAND
            );
            exit(EXIT_SUCCESS);
            break;
        case CD_SETUP_NOT_FOUND:
            MessageBoxA(
                gAppWindow,
                "У вас должен быть компакт-диск героев в CD приводе, чтобы\nиспользовать редактор Героев Меча и Магии.  \n\nПожалуйста, вставьте компакт-диск и попробуйте еще раз.",
                "Ошибка загрузки",
                MB_ICONHAND
            );
            exit(EXIT_SUCCESS);
            break;
        case CD_SETUP_NO_APP_PATH:
            MessageBoxA(
                gAppWindow,
                "Невозможно изменить директорию. Пожалуйста, переустановите программу.",
                "Ошибка загрузки",
                MB_ICONHAND
            );
            exit(EXIT_SUCCESS);
            break;
        case CD_SETUP_NO_DATA:
            MessageBoxA(
                gAppWindow,
                "Невозможно найти файлы данных Героев.  Пожалуйста, переустановите программу.",
                "Ошибка загрузки",
                MB_ICONHAND
            );
            exit(EXIT_SUCCESS);
            break;
    }
    gDefaultMenu = LoadMenuA(gAppInstance, "mnuDflt");
    for (i = 0; i < MAP_CELL_GROUND_TILE_COUNT; i++)
        gGroundToTerrain[i] = (i / MAP_CELL_TILES_PER_TERRAIN);
    return true;
}

void MemError(void) {
    ShutDown("Out of Memory");
}

bool IsCDDrive(i32 driveIndex) {
    sprintf(gText, "A:\\");
    gText[0] += driveIndex;
    return GetDriveTypeA(gText) == DRIVE_CDROM;
}

void InitMainClasses(void) {
    gExec = new executive;
    gInputManager = new inputManager;
    gMouseManager = new mouseManager;
    gWindowManager = new heroWindowManager;
    gResourceManager = new resourceManager;
    gBufferPalette = new palette;
    gEditManager = new editManager;
}

void DeleteMainClasses(void) {
    if (gEditManager)
        delete gEditManager;
    gEditManager = NULL;
    if (gBufferPalette)
        delete gBufferPalette;
    gBufferPalette = NULL;
    if (gResourceManager)
        delete gResourceManager;
    gResourceManager = NULL;
    if (gWindowManager)
        delete gWindowManager;
    gWindowManager = NULL;
    if (gMouseManager)
        delete gMouseManager;
    gMouseManager = NULL;
    if (gInputManager)
        delete gInputManager;
    gInputManager = NULL;
    if (gExec)
        delete gExec;
    gExec = NULL;
}

void NormalDialog(
    char* text,
    i32 dialogType,
    i32 x,
    i32 y,
    i32,
    i32,
    i32,
    i32,
    i32
) {
    i32 sizedHeight;
    i32 width;
    tag_message msg;
    i32 rows;
    char iconFile[NORMAL_DIALOG_FILENAME_LENGTH];
    i32 wrappedLines;
    i32 totalHeight;
    i32 iconFrameIndex;
    i16 showMessageText;
    i32 nextId;
    i32 panelHeight;
    i32 frameHeight;
    textWidget* captionText;
    i32 index;
    i32 resourceIconY;
    i32 tallestImage;
    font* bigFont;
    i32 resWidth;
    char* orWord;

    nextId = NORMAL_DIALOG_TEXT_WIDGET_FIRST_ID;
    showMessageText = 1;
    bigFont = gResourceManager->GetFont("bigfont.fnt");
    wrappedLines = bigFont->LineLength(text, NORMAL_DIALOG_TEXT_LINE_WIDTH);
    gResourceManager->Dispose(bigFont);
    totalHeight = wrappedLines * NORMAL_DIALOG_TEXT_LINE_HEIGHT;
    if (dialogType != NORMAL_DIALOG_TYPE_QUICK_VIEW)
        totalHeight += NORMAL_DIALOG_BUTTON_AREA_HEIGHT;
    rows = (totalHeight - 12) / NORMAL_DIALOG_WINDOW_ROW_HEIGHT;
    if (rows > NORMAL_DIALOG_MAX_ROWS)
        rows = NORMAL_DIALOG_MAX_ROWS;
    if (rows <= 0 && dialogType != NORMAL_DIALOG_TYPE_QUICK_VIEW)
        rows = 1;
    width = NORMAL_DIALOG_WINDOW_WIDTH;
    panelHeight = rows * NORMAL_DIALOG_WINDOW_ROW_HEIGHT + NORMAL_DIALOG_WINDOW_BASE_HEIGHT;

    if (x == NORMAL_DIALOG_AUTO_POSITION || width + x >= LOGICAL_SCREEN_WIDTH - 1)
        x = NORMAL_DIALOG_ADVENTURE_X;
    if (y == NORMAL_DIALOG_AUTO_POSITION || panelHeight + y >= LOGICAL_SCREEN_HEIGHT - 1) {
        y = (LOGICAL_SCREEN_HEIGHT - panelHeight) / 2;
        if (y > NORMAL_DIALOG_MAX_TOP)
            y = NORMAL_DIALOG_MAX_TOP;
    }

    sprintf(iconFile, "evntwin%d.bin", rows);
    gNormalDialogWindow = new heroWindow(x, y, iconFile);
    if (!gNormalDialogWindow)
        MemError();

    msg.type = MESSAGE_WIDGET;
    msg.command = WIDGET_COMMAND_CLEAR_FLAGS;
    msg.value = NORMAL_DIALOG_BUTTON_FLAGS;
    if (dialogType != NORMAL_DIALOG_TYPE_WAIT_CANCEL
        && dialogType != NORMAL_DIALOG_TYPE_NO_BUTTONS) {
        msg.id = NORMAL_DIALOG_BUTTON_OK;
        gNormalDialogWindow->BroadcastMessage(msg);
    }
    if (dialogType != NORMAL_DIALOG_TYPE_WAIT_OK && dialogType != NORMAL_DIALOG_TYPE_OK
        && dialogType != NORMAL_DIALOG_TYPE_NO_BUTTONS) {
        msg.id = NORMAL_DIALOG_BUTTON_CANCEL;
        gNormalDialogWindow->BroadcastMessage(msg);
    }
    if (dialogType != NORMAL_DIALOG_TYPE_YES_NO) {
        msg.id = NORMAL_DIALOG_BUTTON_YES;
        gNormalDialogWindow->BroadcastMessage(msg);
        msg.id = NORMAL_DIALOG_BUTTON_NO;
        gNormalDialogWindow->BroadcastMessage(msg);
    }

    SET_WIDGET_MESSAGE(msg, WIDGET_COMMAND_SET_TEXT, NORMAL_DIALOG_TEXT_WIDGET_ID);
    msg.text = text;
    gNormalDialogWindow->BroadcastMessage(msg);

    if (dialogType == NORMAL_DIALOG_TYPE_QUICK_VIEW) {
        gMouseManager->ReallyHidePointer();
        gWindowManager->AddWindow(gNormalDialogWindow, WINDOW_Z_ORDER_APPEND, true);
        QuickViewWait();
        gWindowManager->RemoveWindow(gNormalDialogWindow);
        gMouseManager->ReallyShowPointer();
    } else {
        gWindowManager->DoDialog(gNormalDialogWindow, EventWindowHandler, false);
    }
    delete gNormalDialogWindow;
}

i16 EventWindowHandler(tag_message& message) {
    if (message.type == MESSAGE_WIDGET) {
        switch (message.command) {
            case WIDGET_NOTIFY_DESELECT:
                switch (message.id) {
                    case CAMPAIGN_INFO_RESTART:
                    case DIALOG_BUTTON_0:
                    case DIALOG_BUTTON_1:
                    case DIALOG_BUTTON_2:
                    case DIALOG_BUTTON_3:
                    case DIALOG_BUTTON_5:
                    case DIALOG_BUTTON_6:
                        FINISH_DIALOG_MESSAGE(message);
                        return MESSAGE_DISPATCH_FORWARD;
                    default:
                        break;
                }
                break;
            default:
                break;
        }
    }
    return MESSAGE_DISPATCH_CONSUME;
}

void QuickViewWait(void) {
    tag_message event;
    b32 done = false;
    while (!done) {
        PollSound();
        Process1WindowsMessage();
        event = gInputManager->GetEvent();
        done = event.type == MESSAGE_RIGHT_BUTTON_UP || event.type == MESSAGE_LEFT_BUTTON_DOWN
               || event.type == MESSAGE_LEFT_BUTTON_UP;
    }
}

void ShowStatusText(char* text) {
    if (gStatusTextShown && !text)
        text = gStatusText;
    else
        strcpy(gStatusText, text);
    gStatusTextShown = true;
    gStatusTextHoldTime = KBTickCount() + EDITOR_STATUS_TEXT_HOLD_MILLISECONDS;
    FillBitmapArea(
        gWindowManager->m_screen,
        EDITOR_STATUS_BAR_X,
        EDITOR_STATUS_BAR_Y,
        EDITOR_STATUS_BAR_WIDTH,
        EDITOR_STATUS_BAR_HEIGHT,
        0
    );
    gEditManager->m_statusFont->DrawBoundedString(
        text,
        EDITOR_STATUS_BAR_X,
        EDITOR_STATUS_BAR_Y,
        EDITOR_STATUS_BAR_WIDTH,
        EDITOR_STATUS_BAR_HEIGHT,
        1,
        FONT_ALIGN_CENTER
    );
    gWindowManager->UpdateScreenRegion(
        EDITOR_STATUS_BAR_X,
        EDITOR_STATUS_BAR_Y,
        EDITOR_STATUS_BAR_WIDTH,
        EDITOR_STATUS_BAR_HEIGHT
    );
}

void ClearStatusText(void) {
    gStatusTextClearTime = EDITOR_STATUS_TEXT_KEPT;
    if (gStatusTextShown) {
        gStatusTextShown = false;
        gEditManager->m_window->DrawWindow(0);
        gWindowManager->UpdateScreenRegion(
            EDITOR_STATUS_BAR_X,
            EDITOR_STATUS_BAR_Y,
            EDITOR_STATUS_BAR_WIDTH,
            EDITOR_STATUS_BAR_HEIGHT
        );
    }
}

void UpdateAppSpecificMenus(void*) {}

void CleanUpMenus(void) {
    if (gAppMenu) {
        SetMenu(gAppWindow, NULL);
        if (gDefaultMenu)
            DestroyMenu(gDefaultMenu);
    }
    gAppMenu = NULL;
}

void EarlyShutDownSystem(void) {
    if (gEditManager)
        gEditManager->SelectTool(EDIT_TOOL_NONE);
}

b32 GameUnsaved(void) {
    return true;
}

i32 HandleAppSpecificMenuCommands(i32 command) {
    switch (command) {
        case APP_MENU_QUIT:
            PostMessageA(gAppWindow, WM_CLOSE, 0, 0);
            break;
        default:
            return 1;
    }
    return 0;
}

void EarlyResizeWindow(i32, i32, i32, i32) {}

void UpdateSystemOptionsMenu(void) {}
